using BarnamenevisanCompany.Domain.Models.SiteSetting;

namespace BarnamenevisanCompany.Infra.Data.Seeds;

public static class SiteSettingSeeds
{
    public static List<SiteSetting> SiteSettings { get; } =
    [
        new()
        {
            Id = 1,
            ConsultInformationText = "مشاوره فقط برای درخواست پروژه هستش نه برای ورود به دنیای برنامه نویسی",
            ContactUsHeaderText = "به ما اطلاع دهید که چگونه می\u200cتوانیم به شما کمک کنیم",
            AboutUsFooter = "ما یک شرکت مستقل و خصوصی در زمینه های مختلف هستیم و مجوز های زیادی در تمام زمینه ها داریم ",
            ContactUsFooter = "نیاز به پشتیبانی دارید؟\n\nHallo@example.com\n\n+391 (0)35 2568 4593 ",
            SiteLogo = "logo.png",
            CompletedProject = 1,
            IndexTitle = "برنامه نویسان پیشرو رسام",
            IndexParagraph = " ارائه دهنده راهکارهای مبتنی بر وب و موبایل\n\nطراحی و برنامه نویسی اختصاصی سایت به همراه پشتیبانی قوی ، برنامه نویسی حرفه ای وب اپلیکیشن ، سئو و بهینه سازی ، مشاوره و مجری استارت آپ ، مشاوره بازاریابی تجارت الکترونیک ",
            IndexOrderTitle = "همین حالا ثبت سفارش کنید",
            IndexOrderParaghraph = "از ابتدا تا انتها همراه شما خواهیم بود و با ایجاد یک طراحی وب سفارشی برای کسب و کار شما، می توانیم دیدگاه شما را زنده کنیم",
            FavIcon = "logo.ico",
            JobListTitle = "به یک جامعه متعهد بپیوندید که با اشتیاق مشترک هدایت می شود",
            JobListDescription = "<p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.\n\nلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است</p>",
            JobListImageName = "default-jobListImage.jpg",
            CreatedDate = SeedStaticDateTime.Date,
            OurServicePageTitle = "بهترین شرکت های جهان به اپلیو اعتماد دارند",
            OurServiceDescription = "<p>تا همین اواخر، دیدگاه غالب فرض می‌کرد که لورم ایپسوم به عنوان یک متن مزخرف متولد شده است. این لاتین نیست، اگرچه به نظر می رسد</p>",
            ConsultSmsMessage = "{0} عزیز !\nدرخواست مشاوره شما با عنوان {1} با موفقیت ثبت شد. کارشناسان ما پس از بررسی درخواست با شما تماس خواهند گرفت.\n\nشرکت برنامه نویسان پیشرو رسام",
            NotificationPhoneNumber = "",
        }
    ];
}